Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Geometry2D
Classes
ArcSegment2D
Represents an arc segment in two-dimensional space.
LineSegment2D
Represents a line segment in two-dimensional space.
Point2D
Represents an x- and y-coordinate pair in two-dimensional space.
Polygon2D
Represents a polygon in two-dimensional space.
PolyLine2D
Represents a polyline in two-dimensional space.
Region2D
Represents a region in two-dimensional space included outline (border) and openings.
SectionCharacteristics
Section characteristics
Segment2D
Represents a segment in two-dimensional space.
TemperatureCurve2D
Reperesents a thermal curve.
Vector2D
Represents a vector in two-dimensional space.